[1,["ecpdLyjvZBwrvm+cedCcQy","d2DgtrO2dLuIyDV3GOwRhn","23Okn1Q2VMzZk/NYpgtXgd","9bvaMerUlDyary99mJa6xp","2a5jkg4rRHQ4YB5H0IYBye","c7OCG4X7NOKqrPMvOnylKU","85t3qlpI9Hp4ODFSTbTJr8","a2MjXRFdtLlYQ5ouAFv/+R","f9Q+K4+gNEeYzKsFu4kN9F","0e1p1Jvp5PQJgH9DC1EHhA","1a3d0Kd/FHRpT1pgoyonho","c9Z5vvIMVBPI4pMFO7SFRo","d8HsitJHxOYqo801xBk8ev","baQYUrq0FM/K1LJ90eae++","72n2B3UUxDias0Tclmwnxe","68KOECXWBBQqvCPJrwA98l"],["node","_spriteFrame","_textureSetter","_parent","root","nodePrivacyPanel","nodeUserPanel","data"],[["cc.Node",["_name","_active","_opacity","_components","_prefab","_contentSize","_parent","_trs","_children","_color","_anchorPoint"],0,9,4,5,1,7,2,5,5],"cc.SpriteFrame",["cc.Widget",["_alignFlags","_left","_originalWidth","_originalHeight","_right","_top","_bottom","node"],-4,1],["cc.Label",["_string","_fontSize","_N$verticalAlign","_lineHeight","_N$horizontalAlign","_N$overflow","_N$cacheMode","node","_materials"],-4,1,3],["cc.Sprite",["_sizeMode","_type","node","_materials","_spriteFrame"],1,1,3,6],["cc.PrefabInfo",["fileId","root"],2,1],["cc.Prefab",["_name"],2],["54796Q0mcBMPJgLsk+nONv0",["node","nodeUserPanel","nodePrivacyPanel"],3,1,1,1],["cc.Layout",["_resize","_N$layoutType","node","_layoutSize"],1,1,5],["cc.ScrollView",["horizontal","brake","bounceDuration","_N$horizontalScrollBar","_N$verticalScrollBar","node","_N$content"],-2,1,1],["cc.Button",["node","clickEvents"],3,1,9],["cc.ClickEvent",["_componentId","handler","target"],1,1],["cc.Mask",["_N$alphaThreshold","node","_materials"],2,1,3]],[[5,0,1,2],[0,0,6,3,4,9,5,10,7,2],[3,0,1,3,2,5,6,7,8,7],[4,0,2,3,4,2],[10,0,1,1],[11,0,1,2,3],[0,0,6,3,4,5,7,2],[0,0,6,3,4,9,5,7,2],[2,0,2,3,7,4],[0,0,6,8,3,4,5,7,2],[4,1,0,2,3,4,3],[3,0,1,3,2,7,8,5],[3,0,1,3,4,2,7,8,6],[0,0,8,3,4,5,10,7,2],[0,0,1,6,8,3,4,5,3],[0,0,6,8,3,4,5,2],[0,0,6,3,4,5,2],[2,0,1,7,3],[4,2,3,4,1],[8,0,1,2,3,3],[9,0,1,2,3,4,5,6,6],[12,0,1,2,2],[6,0,2],[0,0,8,3,4,5,7,2],[0,0,2,6,3,4,9,5,3],[0,0,1,6,3,4,9,5,7,3],[7,0,1,2,1],[2,0,7,2],[2,0,1,4,5,6,2,3,7,8],[5,1,1],[3,0,1,4,2,7,8,5]],[[[{"name":"privacy","rect":[0,0,81,22],"offset":[0,0],"originalSize":[81,22],"capInsets":[0,0,0,0]}],[1],0,[0],[2],[4]],[[{"name":"bg_xian","rect":[0,0,564,3],"offset":[0,0],"originalSize":[564,3],"capInsets":[0,0,0,0]}],[1],0,[0],[2],[5]],[[{"name":"close","rect":[0,0,72,72],"offset":[0,0],"originalSize":[72,72],"capInsets":[0,0,0,0]}],[1],0,[0],[2],[6]],[[[22,"PrivacyPolicy"],[23,"PrivacyPolicy",[-6,-7,-8,-9],[[26,-4,-3,-2],[27,45,-5]],[29,-1],[5,750,1334],[375,667,0,0,0,0,1,1,1,1]],[9,"Node Content",1,[-11,-12,-13,-14,-15,-16,-17,-18,-19],[[10,1,0,-10,[18],19]],[0,"e89bauxSpF1biDN59+LekQ",1],[5,450,380],[0,0,0,0,0,0,1,1.3,1.3,1]],[13,"content",[-22,-23,-24,-25,-26,-27],[[17,1,265,-20],[19,1,2,-21,[5,750,11800]]],[0,"2bNKW0gQhL2J5Rro7PwsXz",1],[5,750,11800],[0,0.5,1],[0,667,0,0,0,0,1,1,1,1]],[13,"content",[-30,-31,-32,-33],[[17,1,265,-28],[19,1,2,-29,[5,750,4539.1]]],[0,"45mDoxmK9OwL8dMScAXPR9",1],[5,750,4539.1],[0,0.5,1],[0,667,0,0,0,0,1,1,1,1]],[14,"Node User",false,1,[-37,-38],[[10,1,0,-34,[29],30],[20,false,0.75,0.23,null,null,-35,3],[8,45,240,250,-36]],[0,"819DiwxyRA/K5DjrgDlJ5Y",1],[5,750,1334]],[14,"Node Privacy",false,1,[-42,-43],[[10,1,0,-39,[38],39],[20,false,0.75,0.23,null,null,-40,4],[8,45,240,250,-41]],[0,"aeJfzCAhxHRICHPMP9qmX9",1],[5,750,1334]],[9,"btn_lan",2,[-46],[[3,0,-44,[13],14],[4,-45,[[5,"54796Q0mcBMPJgLsk+nONv0","acceptHandle",1]]]],[0,"beWLMX+epJErI8s1jbxwzb",1],[5,150,50],[93.95,-117.853,0,0,0,0,1,1,1,1]],[9,"btn_lan",2,[-49],[[4,-47,[[5,"54796Q0mcBMPJgLsk+nONv0","refuseHandle",1]]],[3,0,-48,[16],17]],[0,"e23JDxZCtKmJKzMAAeESZm",1],[5,150,50],[-93.95,-117.853,0,0,0,0,1,1,1,1]],[15,"view",5,[3],[[21,0,-50,[26]],[8,45,240,250,-51]],[0,"1fjmiPYoVCvKRUV2jqJdpn",1],[5,750,1334]],[15,"view",6,[4],[[21,0,-52,[35]],[8,45,240,250,-53]],[0,"d1bxnyVjFCM4R4B7Xuv9un",1],[5,750,1334]],[24,"Mask",200,1,[[3,0,-54,[0],1],[28,45,-625,-625,-333,-333,750,1334,-55]],[0,"f6AZjQ/6ZI36hO5zg+Bgp3",1],[4,4278190080],[5,2000,2000]],[6,"Node User",2,[[18,-56,[5],6],[4,-57,[[5,"54796Q0mcBMPJgLsk+nONv0","openUserPanelHandle",1]]]],[0,"eaIjDiosVMYbVpHDNCzpoK",1],[5,81,22],[7.004,49.439,0,0,0,0,1,1,1,1]],[6,"Node Privacy",2,[[18,-58,[7],8],[4,-59,[[5,"54796Q0mcBMPJgLsk+nONv0","openPrivacyPanelHandle",1]]]],[0,"05oZUCVMdNo7ajPQrB8wWn",1],[5,81,22],[-102.561,49.86,0,0,0,0,1,1,1,1]],[6,"close",5,[[3,0,-60,[27],28],[4,-61,[[5,"54796Q0mcBMPJgLsk+nONv0","closeHandle",1]]]],[0,"0cZuGUzlNOGZT2CdSeRiwf",1],[5,50,50],[-343.872,634.14,0,0,0,0,1,1,1,1]],[6,"close",6,[[3,0,-62,[36],37],[4,-63,[[5,"54796Q0mcBMPJgLsk+nONv0","closeHandle",1]]]],[0,"5fqUKdprxPjaijM7MDp6xJ",1],[5,50,50],[-343.872,505.537,0,0,0,0,1,1,1,1]],[7,"New Label",2,[[30,"欢迎使用我们的游戏",26,1,1,-64,[2]]],[0,"7cb03V0FRD2b/OIMBg/B3X",1],[4,4284835173],[5,234,50.4],[0,145,0,0,0,0,1,1,1,1]],[7,"New Label",2,[[11,"点击确定即表示您确认您已经查看并接受我\n们的                ",20,30,1,-65,[3]]],[0,"d9o8tgRtRJ0I/D6HtUIYF7",1],[4,4280690214],[5,380,67.8],[0,65,0,0,0,0,1,1,1,1]],[7,"New Label copy",2,[[11,"和",20,30,1,-66,[4]]],[0,"2ca7f7aGBNgLSudaUswewV",1],[4,4280690214],[5,20,37.8],[-49.119,51.614,0,0,0,0,1,1,1,1]],[25,"New Label",false,2,[[11,"邮箱：xiaobaiyouxiyouxi@163.com",20,30,1,-67,[9]]],[0,"e7RhgDWSFBQL6JaPAJYbgq",1],[4,4280690214],[5,313.77,37.8],[-33,-5,0,0,0,0,1,1,1,1]],[6,"bg_xian",2,[[3,0,-68,[10],11]],[0,"345/HfNjBJ6YLjhKOqQcJ/",1],[5,400,3],[0,-55,0,0,0,0,1,1,1,1]],[16,"New Label",7,[[12,"同意",24,30,1,1,-69,[12]]],[0,"dcdJNxi8JBLKTCJjIRU3Gb",1],[5,48,37.8]],[16,"New Label",8,[[12,"不同意",24,30,1,1,-70,[15]]],[0,"ddDk/saUxB0KReb3sKzM1b",1],[5,72,37.8]],[1,"item",3,[[2,"\n                                                                用户服务协议\n\n更新日期：2021年12月30日\n\n \n\n欢迎申请使用乐果提供的服务！\n\n《用户使用许可服务协议》（以下简称“本协议”或“用户协议”）由您与乐果游戏服务提供方共同缔结，本协议具有合同效力。为保障您的合法权益，请您在同意并接受本协议所有条款前务必审慎阅读、充分理解各条款内容，特别是免除或限制责任的条款，以及开通或使用某项服务的单独协议。限制、免责条款可能以黑体加粗形式提示您注意。\n\n当您在线点击登录游戏后，视为您已详细阅读理解了本协议的全部内容，并同意遵守本协议的规定。除非您已阅读并接受本协议所有条款，否则您无权使用乐果游戏服务。您使用乐果游戏服务即视为您已阅读并同意签署本协议。\n\n如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。\n\n开发者和用户同意、理解并遵循以下条款，该部分条款不仅适用于乐果游戏服务，若开发者的其他相关服务涉及类似、相关情形的，也同时适用，均有约束力。\n\n \n\n第一章     定义\n\n如无特别说明，下列术语在本协议中的含义为：\n\n1.1    本协议：指本协议正文、游戏规则及其修订版本。上述内容一经正式发布，即为本协议不可分割的组成部分。如您需要使用乐果提供的其他服务内容，您还应遵守与这些服务有关的服务协议条款，同时这些协议也将构成本协议不可分割的组成部分。\n\n1.2    游戏规则：指乐果游戏服务提供方不时发布并修订的关于乐果游戏的用户守则、玩家条例、游戏公告及通知等内容。\n\n1.3    乐果游戏服务提供方：指向您提供乐果游戏及其服务的海南乐果互娱科技有限公司及其关联公司，在本协议中简称为“乐果”。\n\n1.4    乐果游戏：指由乐果负责运营的游戏的统称，包括计算机客户端游戏、网页游戏、移动端游戏等形式的游戏；乐果游戏可能以软件形式提供，这种情况下，乐果游戏还包括相关软件及相关文档。\n\n1.5    乐果游戏服务：指乐果向您提供的与游戏相关的各项在线运营服务。\n\n1.6    乐果游戏组成元素：指乐果游戏所包含及与之相关的文字、图片、音频、视频、图标、界面设计、版面框架、有关数据或电子文档等内容和信息。\n\n1.7    您：又称“玩家”或“用户”，指被授权使用乐果产品及其服务的自然人。\n\n1.8    游戏数据：指您在使用乐果游戏过程中产生的被服务器记录的各种数据，包括但不限于游戏日志、安全日志等数据。\n\n1.9    非法充值：指除乐果游戏官方版本内接入的支付渠道之外的其他任何充值渠道进行的充值。\n\n1.10  虚拟物品：包括但不限于乐果游戏内虚拟货币、道具、装备、材料等。\n\n1.11  用户信息：指您在实名注册系统中注册的信息、您游戏账号下的游戏数据以及其他您在使用乐果游戏服务的过程中向乐果提供或乐果基于安全、用户体验优化等考虑而需收集的信息和数据。\n\n第二章     知识产权权利声明\n\n 2.1    乐果享有乐果游戏及服务本身以及乐果游戏及服务组成元素（包括但不限于美术作品、文字作品、音乐作品等）的所有权和全部相关的知识产权，但第三方权利人依照法律规定或其他约定应享有的权利除外。\n\n2.2    您在使用乐果游戏服务中产生的游戏数据的所有权和全部相关的知识产权归乐果所有，乐果有权处置该游戏数据。\n\n2.3    本协议不应视为乐果向您许可或转让乐果游戏和乐果游戏组成元素相关的任何权利或利益。用户根据乐果的许可，依据乐果游戏组成元素进行二次创作（包括但不限于美术作品、文字作品、音乐作品等）的作品，不得违反6.8条中的相关规定，知识产权属于乐果，用户未经乐果书面许可，不得进行商业形式的利用。\n\n2.4    就乐果游戏和乐果游戏组成元素可能涉及的第三方享有的知识产权，您应当以本协议规定的方式进行使用。仅因您违反本协议规定或其他您单方原因而导致的对任何第三方享有的知识产权的侵权，需由您独立承担责任，并赔偿乐果所遭受的任何损失。\n\n 2.5  乐果部分服务包含内容分享等功能，您承诺对于您创作并通过乐果服务上传到乐果服务中的内容（他人所享有权利的内容除外）依法享有知识产权或已得到相关权利人的合法授权。对于您通过乐果服务上传到乐果服务中可公开获取区域的任何原创内容，您同意乐果在全世界范围内具有免费的、永久性的、不可撤销的权利和许可，以使用、复制、修改、翻译、据以创作衍生作品、传播、表演和展示此等内容，以及将上述内容转让、许可给第三方使用和传播。上述权利的使用范围包括但不限于在当前或其他网站、应用程序、产品或终端设备等使用。",16,20,1,3,2,-71,[20]]],[0,"e99BarTjROkIg7X6R3HlTz",1],[4,4278190080],[5,680,1720],[0,0,1],[-340,0,0,0,0,0,1,1,1,1]],[1,"item",3,[[2,"第三章     游戏账号的取得、使用与保管\n\n3.1    游戏账号的取得\n\n（1）     您如果需要使用和享受乐果游戏以及乐果游戏服务，则您必须完全同意本协议条款，按照本协议条款的要求，并按照注册页面的要求完成注册程序，包括但不限于输入正确的基本资料和信息。用户承诺以其真实身份注册，包括但不限于按照乐果游戏的要求进行实名认证并同意将所填写的信息交由第三方机构进行校验，并保证其所提供的资料和信息是真实、完整、有效的，用户依据法律规定及本协议约定对所提供的信息承担相应的法律责任。\n\n（2）     您注册成功，会得到相应的账号，即可登录游戏和/或使用相关服务。\n\n（3）     您拒绝按照要求提供相应资料和信息，或者提供的资料和信息不符合要求的，乐果有权拒绝提供相关服务或承担任何义务。如果您所提供的资料和信息有任何变更，您应及时进行更新，乐果将及时提供该项服务。游戏账号信息发生变更而未及时修改，导致无法证明您的有效身份，乐果有权拒绝提供任何信息或承担任何义务。\n\n（4）     您对您所创建的游戏账号只享有使用权，游戏账号所有权归乐果所有。\n\n（5）     您充分理解并同意：乐果有权审查您注册所提供的身份信息是否真实、有效，并有权采取技术与管理等合理措施保障您游戏账号的安全、有效。乐果会按照国家相关要求将您的实名注册信息运用于防沉迷系统之中，即乐果可能会根据您的实名注册信息判断您是否年满18周岁，从而决定是否对您的游戏账号予以防沉迷限制。\n\n3.2    用户账号的使用和保管\n\n（1）     您有义务妥善保管您的游戏账号及相关密码，并正确、安全地使用您的游戏账号及密码。您依照本协议约定注册的游戏账号，仅用于您个人娱乐或消费的目的。您对登录后所持游戏账号产生的行为依法享有权利和承担责任，不得将游戏账号与第三人共享或将游戏账号转让、赠与给他人或请他人代练等，因您未妥善保管账号及密码，并正确、安全地使用账号及密码导致账号密码遗失、账号被盗等情形而给您和他人的民事权利造成损害的，您需要承担由此产生的法律责任。\n\n（2）     您应在知晓您的账号或密码被他人非法使用、被盗或出现异常情况后第一时间通知乐果，并有权通知乐果采取措施暂停该游戏账号的登录和使用。\n\n（3）     乐果根据您的通知采取措施暂停用户账号的登录和使用的，乐果有权要求您提供并核实您与注册身份信息相一致的个人有效身份信息。乐果核实您所提供的个人有效身份信息与所注册的身份信息相一致的，应当及时采取措施暂停用户账号的登录和使用，如核实信息一致后，因乐果未及时采取措施暂停用户账号的登录和使用，因此而给用户造成损失的，应当承担其相应的法律责任。如您没有提供您个人有效身份证明或者您提供的个人有效身份证明与所注册的身份信息不一致的，乐果有权拒绝您提出的暂停游戏账号的登录和使用的请求。\n\n（4）     您充分理解并同意，为提高乐果游戏服务的安全水平，乐果有权将有关技术或软件应用到乐果游戏中，但乐果不保证这些安全保证措施可以完全杜绝游戏账号被他人窃取或丢失的风险。\n\n（5）     您充分理解并同意，若乐果按照相关业务规则限制、冻结或终止您的游戏账号的使用，可能会导致您游戏账号下游戏数据及相关信息被删除，以及相关权益的丧失，该损失由您自行承担，对此乐果不承担任何责任。\n\n（6）     您充分理解并同意接受乐果通过短信或其他方式向您发送乐果或其合作伙伴的商品促销、游戏服务或其他相关商业信息。如您希望停止接收乐果的推送信息，可通过乐果官方网站公布的联系方式与乐果联系，告知取消请求，经开发者核实后取消推送。\n\n（7）     您充分理解并同意，为高效利用服务器资源，如果您长期未使用游戏账号登录乐果游戏，乐果有权视需要，在提前通知的情况下，对该游戏账号及其账号下的游戏数据及相关信息采取删除等处置措施，上述处置可能导致您对该游戏账号下相关权益的丧失，对此乐果不承担任何责任。\n\n（8）     如果您为了维护您的合法权益，向乐果提供与所注册的身份信息相一致的个人有效身份信息时，乐果同意根据行政机关和司法机关的要求为您提供账号注册人证明、原始注册信息等必要的协助和支持，并根据需要向该等部门提供相关证据信息资料。\n\n \n\n第四章     用户信息收集、使用及保护\n\n4.1   您同意并授权乐果为履行本协议之目的收集和使用您的用户信息。乐果对您的用户信息所包含的个人信息的收集、使用、分享、保存和管理将遵守乐果统一公布的《隐私政策》以及相关法律法规的规定。\n\n4.2   您充分理解并同意：若您在使用乐果游戏服务中向他人透露自己的各类财产帐户、银行卡、信用卡及对应密码等重要资料和信息，因此所产生的任何损失将由您自行承担。",16,20,1,3,2,-72,[21]]],[0,"136At55DhD6qUKIGRG/3/P",1],[4,4278190080],[5,680,1480],[0,0,1],[-340,-1720,0,0,0,0,1,1,1,1]],[1,"item",3,[[2,"第五章     乐果游戏和乐果游戏服务\n\n5.1   您仅可为非商业目的通过以下方式使用乐果游戏和乐果游戏服务：\n\n（1）     接收、下载、安装、启动、升级、登录、显示、运行和/或截屏乐果游戏；\n\n（2）     创建游戏角色，设置网名，查阅游戏规则、用户个人资料、游戏对局结果，设置游戏参数，使用聊天功能，社交分享功能，在游戏中通过正当途径购买、使用、赠送虚拟物品等。\n\n（3）     使用乐果游戏支持并允许的其他的某一项或某几项功能。\n\n您进行的其他任何形式的未经许可的安装、使用、访问、显示、运行以及转让，都将被视为对协议的违反。\n\n5.2   您在使用乐果游戏服务过程中不得未经乐果许可以任何方式录制并向他人传播乐果游戏内容，包括不得利用任何第三方软件进行网络传播等。\n\n5.3   在乐果以软件形式提供的情况下，您在使用乐果游戏及服务时还应符合本协议关于软件下载和安装的规定。\n\n5.4   如果乐果发现或收到他人举报或投诉您违反本协议约定的，乐果有权不经通知随时对相关内容进行删除，并视行为情节对违规游戏账号外以包括但不限于警告、限制或禁止使用全部或部分功能、游戏账号封禁直至注销的处罚，并公告处理结果。\n\n5.5   您充分理解并同意，乐果有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行为，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此产生的一切法律责任。\n\n5.6   您充分理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；乐果因此遭受损失的，您也应当一并赔偿。\n\n5.7   您充分理解并同意：虚拟物品等是乐果游戏服务的一部分，乐果在此许可您依本协议而获得其使用权。您购买、使用虚拟物品等应遵循本协议、游戏具体规则的要求；同时，虚拟物品等可能受到一定有效期的限制，若您在规定的有效期内未使用的，除不可抗力或可归责于乐果的原因外，一旦有效期届满，将会自动失效。\n\n5.8   您充分理解并同意：为营造公平、健康的游戏环境，在您使用乐果游戏服务的过程中，乐果有权通过技术手段了解您的相关终端设备信息。一经发现有任何未经授权、危害乐果游戏服务正常运营的相关程序，乐果将收集所有与此有关的信息并采取合理措施予以打击。\n\n5.9   您充分理解并同意：您使用乐果游戏的收费功能时，应当按照乐果的要求支付相应的费用。而且，该等权利属于乐果的经营自主权，乐果保留随时更改经营模式的权利，即保留变更收费的费率标准、收费的软件功能、收费对象及收费时间等权利。同时，乐果也保留对该应用程序进行升级、改版、增加、删除、修改、变更其功能或者变更游戏规则的权利。您如果不接受该等变更的，应当立即停止使用应用程序；您继续使用应用程序的行为，视为您接受改变后的经营模式。\n\n 当您进行充值时，您必须仔细确认自己的账号及信息，若因为您自身输入账号错误、操作不当、不了解或未充分了解充值计费方式等因素造成充错账号、错选充值种类等情形而损害自身权益，乐果不承担责任。\n\n5.10 您充分理解并同意：为了保证您及其他用户的游戏速度，乐果有权定期转移或者清除乐果游戏服务器上存储的一些过往的游戏数据。\n\n5.11 您充分理解并同意：您在使用的本游戏服务涉及到互联网服务，可能会受到互联网各个环节不稳定因素的影响。因此本游戏服务存在不可抗力、病毒或黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险。   \n\n有鉴于此，在适用法律允许的最大范围内，乐果并不担保所提供的游戏服务一定能满足您的要求，也不担保提供的游戏服务不会被中断，并且对游戏服务的及时性、安全性、出错发生以及信息是否能准确、及时、顺利传送均不作任何担保。\n\n5.12 您充分理解并同意：在使用乐果游戏服务时，存在有来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权）的匿名或冒名的信息的风险，您须承担以上风险，乐果对游戏服务不作任何类型的担保，不论是明确的或隐含的，包括所有有关信息真实性、适商性、适于某一特定用途、所有权和非侵权性的默示担保和条件，对因此导致任何因您不正当或非法使用服务产生的直接、间接、偶然、特殊及后续的损害，不承担任何责任。\n\n5.13 您充分理解并注意以下内容：\n\n（1）     乐果可能会不定期地通过发布软件升级包或软件补丁、在线升级等方式对应用进行更新。更新的过程中，乐果可能通过调取、收集您的个人关于游戏的客户端软件版本信息等信息，并自动进行替换、修改、删除和/或补充。此种行为是软件更新的所必须的一种操作或步骤，您如果不同意乐果进行此种操作，请您不要进行更新；您使用的行为即视为您同意乐果进行此种操作。\n\n（2）     对于游戏来说，某些更新可能是软件版本的更新，如果您不进行此种更新则将无法登录该应用。而且，此种更新将会导致您使用的终端上原有的软件版本完全被新的软件版本替换掉。\n\n（3）     从第三方获得游戏币、游戏道具、游戏装备等虚拟物品可能存在各种风险。您不得从第三方获得上述游戏虚拟物品，您如果坚持从第三方获得上述游戏虚拟物品，则您应当自行承担相应的风险，乐果有权直接将该等游戏虚拟物品索回或做删除等处理。\n\n（4）     乐果因用户从事违反本协议或法规行为而采取的措施，可能会导致您当前游戏账号项下的有使用期限的虚拟物品等因使用期限在乐果采取上述措施期间届满而无法继续使用，由此给您造成的损失由您自行承担。即乐果采取上述措施所持续的时间是计算在有使用期限的虚拟物品的使用期限当中的；该等措施执行终止后，虚拟物品的使用期限并不会因此续延。\n\n5.14 乐果可能会通过应用官方网站、客服电话、游戏管理员、或者其他的途径，向您提供诸如游戏规则说明、BUG（又称漏洞、缺陷等）或外挂投诉、游戏物品找回、游戏物品锁定或解除锁定、帐号申诉等客户服务，以上服务的提供应建立在以下前提条件之上：\n\n（1）     通过乐果客服官方网站或者乐果提供的其他途径了解这些客户服务的内容、要求以及资费，谨慎选择是否需要享受相应的客户服务，向乐果真实地准确地表达您的需求。\n\n（2）     同意并接受乐果关于该等客户服务的专门协议或条款。\n\n（3）     按照乐果的要求如实提供您的相关个人信息和游戏情况，及您掌握的其他用户或网络游戏本身的情况，例如：您的帐户及其项下的个人资料、网络游戏的登录情况和游戏物品情况，应用程序当中存在的BUG（又称漏洞、缺陷等）、外挂及您知晓的其他玩家使用BUG（又称漏洞、缺陷等）或外挂的情况。\n\n5.15 发生下列情形之一时，乐果有权停止或中断游戏服务器所提供之服务，对因此而产生的不便或损害，乐果对用户或第三人均不承担任何责任：\n\n（1）     定期检查或施工、更新软硬件等，乐果有权暂停服务，但会尽快完成维护、更新工作；\n\n（2）     服务器遭受损坏，无法正常运作；\n\n（3）     突发性的软硬件设备与电子通信设备故障；\n\n（4）     网络提供商线路或其它故障；\n\n（5）     在紧急情况下为维护国家安全或其他用户及第三者之人身安全；\n\n（6）     不可抗力及其他第三方原因。\n\n5.16 乐果将按照相关法律法规和本协议的规定，采取切实有效的措施保护未成年人在使用乐果游戏服务过程中的合法权益，包括可能采取技术措施、禁止未成年人接触不适宜的游戏或者游戏功能、限制未成年人的游戏时间、消费、预防未成年人沉迷网络。作为游戏规则的一部分，乐果还将在适当位置发布乐果游戏用户指引和警示说明，包括游戏内容介绍、正确使用游戏的方法以及防止危害发生的方法。所有未成年人用户都应在法定监护人的指导下仔细阅读并遵照执行这些指引和说明；其他玩家在使用乐果游戏服务的过程中应避免发布、产生任何有损未成年人身心健康的内容，共同营造健康游戏环境。\n\n乐果不鼓励未成年人使用乐果的产品/服务进行任何消费行为，如有消费，未成年人应以法定监护人名义申请消费或在法定监护人明示同意下操作。未成年人使用乐果的行为即视为已获得了法定监护人认可。未成年人的法定监护人，应当保管好支付设备、支付账户及支付密码等，以避免被监护人在未取得同意的情况下通过使用充值等功能。",16,20,1,3,2,-73,[22]]],[0,"19tiyDIEdM85faroBxIBR7",1],[4,4278190080],[5,680,2580],[0,0,1],[-340,-3200,0,0,0,0,1,1,1,1]],[1,"item",3,[[2,"\n 第六章     用户行为规范及内容社区管理\n\n6.1   您充分了解并同意，您必须为自己游戏账号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。您应对乐果游戏中的内容自行加以判断，并承担因使用乐果游戏服务而引起的所有风险，包括因对乐果游戏内容的正确性、完整性或实用性的依赖而产生的风险。乐果游戏无法且不会对因前述风险而导致的任何损失或损害而承担责任。\n\n6.2   您除了可以按照本协议的约定使用乐果游戏服务之外，不得进行任何侵犯乐果游戏和乐果游戏组成元素相关的知识产权的行为，或者进行其他的有损于乐果或其他第三方合法权益的行为。\n\n6.3   除非法律允许或乐果书面许可，您在使用乐果游戏服务过程中不得实施包括但不限于下列行为：\n\n（1）     删除游戏及其他副本上所有关于版权的信息、内容；\n\n（2）     对游戏进行反向工程、反向汇编、反向编译或者以其他方式尝试发现软件的源代码等，以及使用或向任何第三方披露该等源代码；\n\n（3）     对游戏软件进行扫描、探查、测试，以检测、发现、查找其中可能存在的BUG（又称漏洞、缺陷等）或弱点；\n\n（4）     对游戏软件或者软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经合法授权的第三方工具/服务接入软件和相关系统；\n\n（5）     修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论上述行为是否为商业目的；\n\n（6）     通过非乐果开发、授权的第三方软件、插件、外挂、系统，使用乐果游戏及乐果游戏服务，或制作、发布、传播非乐果开发、授权的第三方软件、插件、外挂、系统；\n\n（7）     对游戏中乐果拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点，建立有关乐果游戏的镜像站点，或者进行网页（络）快照，或者利用架设服务器等方式，为他人提供与乐果游戏服务完全相同或类似的服务等；\n\n（8）     将乐果游戏的任意部分分离出来单独使用，或者进行其他的不符合本协议的使用；\n\n（9）     以不符合本协议所规定的方式使用乐果游戏的名称、商标或其它知识产权；\n\n（10）  在游戏中进行“拉人”“导量”等行为；\n\n（11）其它未经乐果明示授权的行为。\n\n6.4   您在使用乐果游戏服务过程中有如下行为的，乐果将视情节严重程度，依据本协议及相关游戏规则的规定，对您作出暂时或永久性的禁止登录、删除游戏账号及游戏数据、删除相关信息等处理措施，情节严重的将移交有关行政管理机关给予行政处罚，或者追究您的刑事责任：\n\n（1）     利用游戏及服务发表、传送、传播、储存危害国家安全、祖国统一、社会稳定的内容，或侮辱诽谤、色情、暴力、引起他人不安或违背社会公德及任何违反国家法律法规政策的内容或者设置含有上述内容的网名、角色名。\n\n（2）     利用游戏及服务发表、传送、传播、储存侵害他人知识产权、商业机密权、肖像权、隐私等合法权利的内容。\n\n（3）     进行任何危害网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器/帐户；未经允许进入公众网络或者他人终端系统并删除、修改、增加存储信息；未经许可企图探查、扫描、测试本“软件”系统或网络的弱点或其它实施破坏网络安全的行为；企图干涉、破坏本“软件”系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；伪造数据包名称或部分名称。\n\n（4）     进行任何破坏乐果游戏服务公平性或者其他影响游戏正常秩序的行为，如主动或被动刷分、合伙作弊、使用外挂或者其他的作弊软件、利用BUG（又叫“漏洞”或者“缺陷”等）来获得不正当的非法利益，或者利用互联网或其他方式将外挂、作弊软件、BUG公之于众。\n\n（5）     利用乐果游戏进行任何诸如发布广告、销售商品的商业行为，或者进行任何非法的侵害乐果利益的行为，如贩卖游戏账号、贩卖游戏内虚拟物品或信息、非法充值、雇佣他人提供游戏内服务并在游戏外支付报酬，例如以营利为目的“打钱”、“代练”服务，以营利为目的交易“虚拟凭证”或者提供中介服务、传播广告等。一经发现，乐果有权中止该用户账号，并有权根据您造成的影响程度自行判定中止期限，并且乐果有权回收及删除您非正常所得的所有数据。\n\n（6）     冒充乐果、游戏服务管理员或游戏论坛管理员、版主发布任何诈骗或虚假信息。\n\n（7）     各种非法外挂行为。\n\n（8）     盗取他人游戏账号、游戏物品。\n\n（9）     私自进行游戏账号交易，私自进行游戏道具、游戏装备、游戏币等交易。\n\n（10）  利用线上游戏系统可能存在的技术缺陷或漏洞而以各种形式为自己及他人牟利。\n\n（11）  利用在使用乐果提供的各种收费或免费游戏过程中所产生并储存于游戏内的全部或部分数据信息，以各种形式为自己及他人牟利。\n\n（12）  宣扬外挂、私服、代练、刷币、木马等内容或公开对乐果进行负面宣传。\n\n（13）  未经允许利用乐果所提供的产品和服务在现实中盈利，以及其他在行业内被广泛认可的不当行为，无论是否已经被本协议明确列举。\n\n6.5   除本协议规定的使用方式之外，未经乐果允许，您不得为下列任何一种行为；您如果要进行下列任何一种行为，请您与乐果联系，取得乐果的同意，并应乐果要求与之签订电子的或者纸版的书面合同：\n\n（1）     修改、复制、发行、出租、出版、翻译、汇编、改编和/或转载游戏或其各种衍生作品，或者利用互联网或其他的方式将其公之于众。\n\n（2）     生产、制作、批发、销售、出版和/或发行该游戏改编衍生品。\n\n（3）     为游戏提供测试、BUG（又叫“漏洞”或者“缺陷”等）及外挂跟踪汇报、软文撰写及推广、竞争情报收集等服务。\n\n（4）     使用游戏的名称、商标等。\n\n（5）     实施上列行为之外的需要开发者同意的其他的有关游戏服务的行为。\n\n6.6   用户如有任何违反本协议或相关法规的，乐果有权采取下列措施当中的一种或几种：\n\n（1）     立即断开您当前使用的终端与应用服务器之间的网络连接，您必须重新登录才能继续使用该应用。\n\n（2）     暂时禁止您凭借当前使用的帐号登录网络游戏。\n\n（3）     暂时禁止您使用应用当中某一要求付费的功能，直至您清偿所欠费用并为继续使用上述付费功能而预先支付相应的费用之日止。\n\n（4）     降低或者清除您当前使用的帐号在应用当中的积分、等级和/或荣誉。\n\n（5）     暂时禁止您凭借当前使用的帐号在网络游戏当中发表任何言论。\n\n（6）     永久性地、不可撤销地将您发布的广告、虚假信息或者非法言论删除，或者采取其他的阻止其传播的措施。\n\n（7）     永久性地、不可撤销地将您非法获取的虚拟货币、游戏道具和/或游戏装备等游戏物品删除，或者将其返还给原来的通过合法途径取得其使用权的其他用户。\n\n（8）     永久性地、不可撤销地将您非法获取的积分、等级和/或荣誉取消或清零。\n\n（9）     永久性地、不可撤销地禁止您凭借当前使用的帐号在应用当中发表任何言论。\n\n（10）  永久性地、不可撤销地删除您当前使用的帐号项下的所有游戏道具、游戏装备、游戏币、积分、等级、荣誉等资料以及相应的游戏数据。\n\n（11）  永久性地、不可撤销地禁止您凭借在当前使用的帐号登录应用，并删除、清空该帐号在应用当中产生的所有数据、游戏币、道具、装备等资料。\n\n（12）  采取上列措施之外的其他措施。\n\n乐果可能会连续地、间断地或者交替地采取前述措施当中的一种或几种。\n\n同一用户若有任一账号或角色存在违反本协议及其他相关规定的，乐果有权对该用户下的所有账号及角色予以制裁，包括但不限于中止、终止、删除该用户下所有账号。\n\n6.7 乐果提供的部分服务包含内容分享及社区功能，您可以使用相关功能制作、评论、发布、传播相关信息；在使用上述功能时，您同意并承诺您制作、评论、发布、传播\n\n6.8 您同意并承诺不制作、复制、发布、传播下列信息：\n\n（1）反对宪法确定的基本原则的；\n\n（2）危害国家安全，泄露国家秘密的；\n\n（3）颠覆国家政权，推翻社会主义制度，煽动分裂国家，破坏国家统一的；\n\n（4）宣扬恐怖主义、极端主义的；\n\n（5）宣扬民族仇恨、民族歧视，破坏民族团结的；\n\n（6）违反国家统一政策的，违反社会主义核心价值观的，违反国家外交政策；\n\n（7）破坏国家宗教政策，宣扬邪教和封建迷信的；\n\n（8）编造、散布谣言、虚假信息，扰乱经济秩序和社会秩序、破坏社会稳定的；\n\n（9）内容涉及低俗、过分暴露、性暗示、不良信息暗示、淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；\n\n（10）侮辱或者诽谤他人，对他人进行骚扰、恐吓、威胁侵害他人合法权益的；\n\n（11）透露自身或他人的个人信息（包括但不限于手机号、社交通讯账号、二维码、收款二维码、银行账号等支付信息，图片、影像等），涉及他人隐私、个人信息或资料的；\n\n（12）危害社会公德，损害民族优秀传统的\n\n（13）侵犯他人相关合法权益内容的；\n\n（14）散布商业广告，或类似的商业招揽信息、过度营销信息及垃圾信息；\n\n（15）诱导未成年人违法犯罪侵害未成年人合法权益或者损害未成年人身心健康的；\n\n（16）与相关服务无关或无实际意义的；\n\n（17）有关法律、行政法规和规定禁止的其他内容；\n\n6.9您制作、发布、传播的内容需遵守相关法律法规规定，不得制作、发布、传播虚假新闻信息等法律法规禁止的信息内容。您在发布或传播利用基于深度学习、虚拟现实等的新技术新应用制作的非真实音视频信息时，应当以显著方式予以标识；\n\n6.10 乐果有权根据国家法律及相关部门的要求对您上传、发布的内容进行监督，如您上传、发布违规信息或您在使用乐果服务中涉及6.8中事项，乐果有权根据相关证据结合现行法律法规、规章及相关规则对违法违规信息进行处理并对您的账号采取相关惩罚措施；\n\n6.11 乐果提供的部分服务若对用户行为有特殊使用规定的，您在使用相关服务时还需遵守该服务的特别使用规则。\n\n",16,20,1,3,2,-74,[23]]],[0,"ceec5OwX1AO5F3rY3O+7e6",1],[4,4278190080],[5,680,3920],[0,0,1],[-340,-5780,0,0,0,0,1,1,1,1]],[1,"item",3,[[2,"第七章     软件的下载和安装\n\n7.1   使用乐果游戏服务可能需要下载并安装相关软件，您可以直接从乐果的相关网站上获取该软件，也可以从得到乐果授权的第三方获取。如果您从未经乐果授权的第三方获取乐果游戏或与乐果游戏名称相同的游戏，将视为您未获取乐果授权，乐果无法保证该游戏能正常使用，并对因此给您造成的损失不予负责。\n\n7.2   乐果可能为不同的终端设备或操作系统开发了不同的软件版本，包括但不限于windows、ios、android、windows phone、symbian、blackberry 等多个应用版本，您应当根据实际情况选择下载合适的版本进行安装，下载安装程序后，您需要按照该程序提示的步骤正确安装。\n\n7.3   未提供更加游戏、安全的服务，在软件安装时，乐果可能推荐您安装其他软件，您可以选择安装或不安装。\n\n7.4   如果您不在需要使用该软件或需要安装新版，可以自行卸载。\n\n7.5   为了保证乐果游戏服务的安全性和功能的一致性，乐果有权不经向您特别通知而对软件进行更新，或者对软件的部分功能效果进行改变或限制。\n\n7.6   软件新版本发布后，旧版本的软件可能无法使用，乐果不保证旧版本软件及相应的客户服务继续可用，请您随时核对并下载最新版本。\n\n \n\n第八章     免责声明\n\n8.1   乐果游戏和乐果游戏服务以实际提供给您的情况和版本为准。乐果不保证：乐果游戏和乐果游戏服务无错误及不会中断、所有缺陷已被更正、或乐果游戏和乐果游戏服务不会受到病毒或任何其他因素的损害。除非有法律明确规定，乐果在此明确声明不承担任何明示或默示的担保责任，包括但不限于对乐果游戏和乐果游戏服务的性能、适用性或不侵权的担保。\n\n8.2   在任何情况下，乐果不对因不可抗力导致的您在使用乐果游戏和乐果游戏服务过程中遭受的损失承担责任。该等不可抗力事件包括但不限于国家法律、法规、政策即国家机关的命令或其他的诸如地震、火灾、雪灾、火灾、海啸、台风、罢工、战争等不可预测、不可避免且不可克服的事件。\n\n8.3   乐果可根据其知悉或掌握的资料或信息独立决定随时变更、终止、中止您对任何乐果游戏和乐果游戏服务的使用，无须向您发出任何提前通知，但根据法律法规规定、本协议约定或您与乐果的约定需要提前通知的除外。若因您的行为违反法律法规的规定或本协议的规定，乐果根据相关规定终止、中止您使用任何乐果游戏和乐果游戏服务，则乐果无需向您承担任何责任，且有权要求您承担相应责任。\n\n8.4   乐果游戏和乐果游戏服务可能因游戏软件BUG（又称漏洞、缺陷等）、版本更新缺陷、第三方病毒攻击、互联网连接或其他任何因素导致您的游戏角色、游戏道具、游戏装备及游戏币等账号数据发生异常。在数据异常的原因未得到查明前，乐果有权暂时冻结该游戏账号；若查明数据异常为非正常游戏行为，乐果有权恢复游戏账号数据至异常发生前的原始状态（包括向第三方追回被转移数据），且乐果无须向您承担任何责任。\n\n8.5   乐果未授权您从任何第三方通过购买、接受赠与或者其他的方式获得游戏账号、游戏道具、游戏装备、游戏币等，乐果不对第三方交易的行为负责，并且不受理因任何第三方交易发生纠纷而带来的申诉。\n\n8.6   您充分理解到：第三方在乐果游戏中投放的广告、链接或者其它形式的推广内容，均是由其自行提供的，您应当自行判断其真实性，乐果对其推广内容不作任何明示或者默示的担保。您通过乐果或其所链接的网站所购买的服务或商品，其交易行为仅存于您与该商品或服务的提供者之间，与乐果无关，乐果不承担您与该商品或服务的提供者之间所产生的任何法律责任。\n\n8.7   您充分理解到：不同操作系统之间存在不互通的客观情况，该客观情况并非乐果造成，由此可能导致您在某一操作系统中的充值和游戏数据不能顺利转移到另一操作系统中。由于您在不同系统进行切换造成的充值损失和游戏数据丢失风险应由您自行承担，不得要求乐果承担任何责任。\n\n8.8   您充分理解到：乐果游戏中可能会设置强制对战区域或玩法，如果您不同意强制对战，请您不要进入该游戏或游戏区域；您的进入，将被视为同意该玩法并接受相应后果。",16,20,1,3,2,-75,[24]]],[0,"8eINguu+tEip+LrOTaVKKd",1],[4,4278190080],[5,680,1280],[0,0,1],[-340,-9700,0,0,0,0,1,1,1,1]],[1,"item",3,[[2,"第九章     隐私政策\n\n9.1   乐果将会采取合理的措施保护用户的个人隐私信息，除本协议另有约定外，乐果游戏服务将遵循乐果统一公布的《隐私政策》。\n\n \n\n第十章     法律监管\n\n10.1 您在使用乐果游戏服务过程中应当遵守当地相关的法律法规，并尊重当地的到的和风俗习惯。如果您的行为违反了当地法律法规或道德风俗，您应当为此独立承当责任。\n\n10.2 您应避免因使用乐果游戏服务而使乐果卷入政治和公共事件，否则乐果有权暂停或终止对您的服务。\n\n \n\n第十一章     管辖与法律适用\n\n11.1 本协议签订地为中华人民共和国广州市天河区。\n\n11.2 本协议适用中华人民共和国的法律和法规（不包括冲突法）。\n\n11.3 在发生因履行本协议而引起的或与本协议有关的争议时，双方应首先通过友好协商解决争议。协商不成的，任何一方可以向本协议签订地有管辖权的人民法院起诉。\n\n11.4 本协议所有条款的标题仅为阅读方便，本身无实际含义，不能作为本协议含义解释的依据。\n\n11.5 本协议条款无论因何种原因部分无效，其余条款仍有效，对各方具有约束力。\n\n \n\n第十二章     其他\n\n12.1 根据国家新闻出版总署关于健康游戏的忠告，乐果提醒您：抵制不良游戏，拒绝盗版游戏；注意自我保护，谨防受骗上当；适度游戏益脑，沉迷游戏伤身。\n\n12.2 如果您对本协议或乐果游戏服务有意见或建议，可与乐果客户服务部门联系，我们会给予您必要的帮助。联系方式如下：\n\n联系邮箱：【leguo-kf@foxmail.com】\n公司地址：广州市天河区珠江新城珠江东路30号广州银行大厦601A。",16,20,1,3,2,-76,[25]]],[0,"92ytdryT9NjpQ3eDVt1HX9",1],[4,4278190080],[5,680,820],[0,0,1],[-340,-10980,0,0,0,0,1,1,1,1]],[7,"title",4,[[12,"\n\n\n\n\n\n\n隐私政策\n\n",30,35,1,1,-77,[31]]],[0,"56xHe7YzVPJoCGtf5mejbs",1],[4,4278190080],[5,120,359.1],[0,-179.55,0,0,0,0,1,1,1,1]],[1,"item",4,[[2,"\n更新日期：2021年8月25日\n生效日期：2021年9月1日\n \n前言\n本政策是由海南乐果互娱科技有限公司（以下统称为“乐果互娱”）在其和/或其关联公司提供的产品和服务（包括乐果互娱现在正在提供和将来可能向用户提供的游戏服务和其他网络服务，以下统称为“产品和服务”）所制定的。\n本政策将帮助您了解以下内容：\n一、我们如何收集和使用您的个人信息\n二、我们如何使用 Cookie 和同类技术\n三、我们如何转让、共享、公开披露您的个人信息\n四、我们如何保护您的个人信息\n五、您的权利\n六、我们如何处理未成年人的个人信息\n（如您作为未成年人的监护人代其注册，请注意阅读该条款）\n七、您的个人信息如何在全球范围转移\n八、本政策可能变更\n九、如何联系我们\n乐果互娱深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。\n请注意，乐果互娱可能适时对本协议进行修改与更新，您同意将随时留意查看本协议的最新版本。请在使用我们的产品（或服务）前，仔细阅读并了解本《隐私政策》，以确保对本《隐私政策》的最新版本始终保持了解。\n一、我们如何收集和使用您的个人信息\n个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。乐果互娱基于本政策所述的以下目的，收集和使用您的个人信息。如需超过以下目的使用您的信息，乐果互娱将以恰当的方式另行征得您的同意：\n（一）为您提供乐果互娱在其和/或其关联公司所提供的产品和服务\n1、注册成为用户。\n为完成创建帐号所填写的信息。例如：您的手机号码、身份证、创建的用户名。\n2、为您提供您可能感兴趣的广告、资讯及产品信息\n为向您提供与您更加相关的广告以替代普遍投放的广告，我们可能会收集和使用您在乐果互娱的操作记录和部分必要的设备信息（例如：您的唯一设备识别码），以及您在使用我们服务时浏览或要求提供的其他信息和内容详情、游戏帐号交易信息，提取您的浏览、行为习惯等特征，并基于特征标签通过电子邮件、短信或其他方式向与您具备相同或相似标签的用户群体发送营销信息，提供或推广我们的产品及服务。\n3、支付结算。\n为便于您在支付相关订单时，综合判断您账户及交易风险、进行身份验证、检测及防范安全事件，我们可能会在交易过程中收集您的个人财产信息（仅限交易记录、虚拟货币、虚拟交易、游戏类兑换码等虚拟财产信息）。\n4、安全保障\n我们会将您的部分个人常用设备信息用于身份验证、安全防范、诈骗监测、存档备份等用途。例如，唯一设备码用于安全防范、用户标识，个人上网记录用于安全防范、诈骗监测。\n当您使用我们的客户服务时，我们可能会保存您的通信/通话记录和内容或您留下的联系方式等信息，以便与您联系或帮助您解决问题，或记录相关问题的处理方案及结果。\n5、产品开发和服务优化。例如，为修复系统故障并优化我们的服务，我们可能需记录和分析系统故障时产生的信息。\n（二）隐私政策的适用范围\n除某些特定产品和服务外，我们所有的产品和服务均适用本《隐私政策》。这些特定产品和服务将适用特定的隐私政策。针对某些特定产品和服务的特定隐私政策，将更具体地说明我们在该等产品和服务中如何收集并使用您的信息。如相关特定产品和服务的隐私政策与本《隐私政策》有不一致之处，适用该特定产品和服务的隐私政策。\n（三）本隐私政策的适用例外\n我们的服务可能包括或链接至第三方提供的社交媒体或其他服务（包括网站）。例如：\n1、您利用“分享”键将某些内容分享我们的服务，或您利用第三方连线服务登录我们的服务。这些功能可能会收集您的相关信息（包括您的日志信息），并可能在您的电脑装置cookies，从而正常运行上述功能；\n2、我们通过广告或我们服务的其他方式向您提供链接，使您可以接入第三方的服务或网站，该第三方对您的信息进行收集与适用。\n该等第三方社交媒体或其他服务可能由第三方运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何个人信息），须受该第三方的服务条款及隐私政策（而非本《隐私政策》）约束，您需要仔细阅读其条款。本《隐私政策》仅适用于我们所收集的信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，我们对任何第三方使用由您提供的信息不承担任何责任。\n（四）应用程序客户端在移动设备上隐私获取的场景举例\n我们通过移动客户端应用程序为您提供服务时，在特定的应用场景下需要获得您的特定个人信息或者取得移动设备的部分特定权限，为此我们会事先征得您的同意。以下是部分应用场景举例说明：\n1、为了实现“手机号一键注册”或与其类似的便捷注册功能，调用移动设备的短信发送与读取功能，或者调用设备码读取权限，以便获取IMEI，分配游客帐号，使用短信发送功能时若将产生任何费用，我们都将预先提示并说明；\n2、为了我们的客服能在应用内更好地解答处理您的客诉问题，调用移动设备的拍照功能权限，拍照并上传处理；\n3、为了在应用程序内实现语音形式的社交功能，调用移动设备的音量调节权限、麦克风权限、录制音频权限或蓝牙配对权限中的一项或数项权限；\n4、为了应用程序自身更新迭代，调用应用内安装其他应用的权限，实现下载、更新的目的；\n5、应用程序报错或崩溃后我们为了获取错误信息进行分析，更好的优化游戏逻辑，带来更好的用户体验，须要获得读取系统日志文件的权限；\n6、应用程序在运行时需要对资源进行必要的缓存和读取，为此我们需要获取读写存储设备信息权限。\n以上仅列举部分获取移动设备权限的应用场景，发生其他权限调用情况时，我们会遵从本隐私政策的原则以及当地的法律规范，充分保障您的知情权等合法权益。",16,20,1,3,2,-78,[32]]],[0,"1bQIB9rr9NBqPfDrQ4U4UF",1],[4,4278190080],[5,680,1680],[0,0,1],[-340,-359.1,0,0,0,0,1,1,1,1]],[1,"item",4,[[2,"二、我们如何使用 Cookie 和同类技术\n（一）Cookie\nCookie 通常包含标识符、站点名称以及一些数字和字符。为确保网站正常运转以及有助于我们辨认您作为我们的注册用户的身份，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。我们不会将 Cookie 用于本政策所述目的之外的任何用途。您可根据自己的偏好通过浏览器或其他方式设置管理或删除 Cookie。\n（二）Do Not Track（请勿追踪）\n很多网络浏览器均设有 Do Not Track 功能，该功能可向网站发布 Do Not Track 请求。目前，主要互联网标准组织尚未设立相关政策来规定网站应如何应对此类请求。但如果您的浏览器启用了 Do Not Track，那么我们的所有网站都会尊重您的选择。但请您注意，可能因此影响您使用乐果互娱提供产品及服务的体验。\n三、我们如何共享、转让、公开披露您的个人信息\n（一）共享\n您理解并同意，我们将确保数据接收方无法重新识别个人信息主体的前提下，通过共享的方式提供给第三方。我们可能在以下情况下与乐果互娱以外的任何公司、组织和个人分享您的个人信息：\n1、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。\n2、我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。\n3、与我们的关联公司共享：您的个人信息可能会与乐果互娱的关联公司共享。我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意。\n4、与授权合作伙伴共享：仅为实现本政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。\n目前，我们的授权合作伙伴包括以下两大类型：\n1）广告、分析服务类的授权合作伙伴。除非得到您的许可，否则我们不会将您的个人身份信息（指足以识别您身份的信息，例如姓名或电子邮箱，通过这些信息可以联系到您或识别您的身份）与提供广告、分析服务的合作伙伴分享。\n2）供应商、服务提供商和其他合作伙伴。我们将信息发送给支持我们业务的供应商、服务提供商和其他合作伙伴，例如代表我们推送通知的通讯服务提供商。这些支持包括提供技术基础设施服务、分析我们服务的使用方式、衡量广告和服务的有效性、提供客户服务、支付便利及其他为乐果互娱产品及服务提供的支持。\n（二）转让\n我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：\n1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；\n2、在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们将通过推送通知、公告或其他方式另行告知您相关情形，按照法律法规所要求的标准继续保护或要求新的管理者按照本政策继续保护您的个人信息。\n（三）公开披露\n我们仅会在以下情况下，公开披露您的个人信息：\n1、获得您明确同意后；\n2、与国家安全、国防安全有关的；\n3、与公共安全、公共卫生、重大公共利益有关的；\n4、与犯罪侦查、起诉、审判和判决执行等有关的；\n5、出于维护信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；\n6、所收集的信息是您自行向社会公众公开的；\n7、从合法公开披露的信息中收集信息的，如合法的新闻报道、政府信息公开等渠道；\n8、根据您的要求签订合同所必需的；\n9、用于维护乐果互娱服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；\n10、为合法的新闻报道所必需的；\n11、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的信息进行去标识化处理的；\n12、法律法规规定的其他情形。\n四、我们如何保护您的个人信息\n（一）我们会采取合理可行的措施，保护您的个人信息。例如，我们使用SSL/hash对您的数据进行加密保护。\n我们设有专门的安全团队，负责处理数据保护的相关事宜。同时，我方也针对具体的用户数据收集及处理过程设置了具体的流程及安全程序，确保对数据的存储和使用符合我们的预期及法律法规的要求。例如，我们对数据的传输使用了TLS/SSL加密技术，对存储的敏感数据采取了SHA256/AES加密算法以保证其安全性。此外，我们会定期对安全策略和数据保护措施采取风险评估，确保我们的产品不会受到数据泄露或侵犯隐私等风险的威胁。\n（二）我们为保护信息采取的其他安全措施\n我们通过建立数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范信息的存储和使用。\n我们通过信息接触者保密协议、监控和审计机制来对数据进行全面安全控制。\n（三）我们仅允许有必要知晓这些信息的乐果互娱员工访问您的信息，同时要求可能接触到您的信息的所有人员履行相应的保密义务。如果未能履行这些义务，可能会被追究法律责任或被中止与乐果互娱的合作关系。\n（四）我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在必要的合理期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。\n（五）互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他乐果互娱用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的帐号安全。\n（六）互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。\n（七）在不幸发生个人信息安全事件后，我们将采取必要措施以阻止安全事件扩大，并以推送通知、公告等形式告知您。",16,20,1,3,2,-79,[33]]],[0,"cfa73MoplOLpqHJkdjzg33",1],[4,4278190080],[5,680,1580],[0,0,1],[-340,-2039.1,0,0,0,0,1,1,1,1]],[1,"item",4,[[2,"五、您的权利\n按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：\n（一）访问您的个人信息\n您有权访问您的个人信息，法律法规规定的例外情况除外。\n（二）控制您的个人信息\n您可查询并管理您账户下关于您的个人信息，乐果互娱帐号名称及身份证号码是您重要的网络身份标识，出于安全性和身份识别的考虑，在注册之后无法变更。\n（三）删除您的个人信息\n我们将按照本政策所述，仅为实现我们产品或服务的功能，收集、使用您的信息。如您发现我们违反法律、行政法规的规定或者双方的约定收集、使用您的个人信息，您可以要求我们删除。如您发现我们收集、存储的您的个人信息有错误的，您也可以要求我们更正。请通过本政策列明的联系方式与我们联系。\n（四）响应您的上述请求\n为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。我们将在合理时限内做出答复。如您不满意，可以联系乐果互娱客服或依《用户注册服务协议》约定方式处理。\n对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情况收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。\n在以下情形中，按照法律法规要求，我们将无法响应您的请求：\n1、与国家安全、国防安全直接相关的；\n2、与公共安全、公共卫生、重大公共利益直接相关的；\n3、与犯罪侦查、起诉、审判和判决执行等直接相关的；\n4、有充分证据表明您存在主观恶意或滥用权利的；\n5、响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；\n6、涉及商业秘密的；\n7、其他我们有合理理由拒绝的情形。\n六、我们如何处理未成年人的个人信息\n乐果互娱遵从国家政策，如果没有父母或监护人的同意，未成年人不得创建自己的用户账户。\n对于经父母或监护人同意而收集未成年人个人信息的情况，我们只会在受到法律的允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用或公开披露此信息。\n七、您的个人信息如何在全球范围转移\n我们的产品和服务只面向中国大陆的用户，我们在中华人民共和国境内收集和产生的个人信息，将存储在中华人民共和国境内，不会在全球范围内转移或传输用户的个人信息。\n八、本政策可能变更\n未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。我们会在本页面上发布对本政策所做的任何变更。\n对于重大变更，我们还会提供更为显著的通知，如您不同意变更后的内容，您可以选择停止使用我们的服务；如您仍然继续使用我们服务的，即表示同意受经修订的本《隐私政策》的约束。\n九、如何联系我们\n如果您对本隐私政策有任何疑问、意见或建议，可通过hainanleguo@163.com与我们联系。如果您对我们的回复不满意，特别是我们的个人信息处理行为损害了您的合法权益，您还可以依《用户服务协议》约定方式处理。\n\n联系邮箱：【leguo-kf@foxmail.com】，\n公司地址：广州市天河区珠江新城珠江东路30号广州银行大厦601A。\n ",16,20,1,3,2,-80,[34]]],[0,"43A36BaplIAK5yhsoR2nXa",1],[4,4278190080],[5,680,920],[0,0,1],[-340,-3619.1,0,0,0,0,1,1,1,1]]],0,[0,4,1,0,5,6,0,6,5,0,0,1,0,0,1,0,-1,11,0,-2,2,0,-3,5,0,-4,6,0,0,2,0,-1,16,0,-2,17,0,-3,18,0,-4,12,0,-5,13,0,-6,19,0,-7,20,0,-8,7,0,-9,8,0,0,3,0,0,3,0,-1,23,0,-2,24,0,-3,25,0,-4,26,0,-5,27,0,-6,28,0,0,4,0,0,4,0,-1,29,0,-2,30,0,-3,31,0,-4,32,0,0,5,0,0,5,0,0,5,0,-1,9,0,-2,14,0,0,6,0,0,6,0,0,6,0,-1,10,0,-2,15,0,0,7,0,0,7,0,-1,21,0,0,8,0,0,8,0,-1,22,0,0,9,0,0,9,0,0,10,0,0,10,0,0,11,0,0,11,0,0,12,0,0,12,0,0,13,0,0,13,0,0,14,0,0,14,0,0,15,0,0,15,0,0,16,0,0,17,0,0,18,0,0,19,0,0,20,0,0,21,0,0,22,0,0,23,0,0,24,0,0,25,0,0,26,0,0,27,0,0,28,0,0,29,0,0,30,0,0,31,0,0,32,0,7,1,3,3,9,4,3,10,80],[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[-1,1,-1,-1,-1,-1,1,-1,1,-1,-1,1,-1,-1,1,-1,-1,1,-1,1,-1,-1,-1,-1,-1,-1,-1,-1,1,-1,1,-1,-1,-1,-1,-1,-1,1,-1,1],[0,7,0,0,0,0,8,0,9,0,0,10,0,0,1,0,0,1,0,11,0,0,0,0,0,0,0,0,2,0,3,0,0,0,0,0,0,2,0,3]],[[{"name":"default_panel","rect":[0,0,20,20],"offset":[0,0],"originalSize":[20,20],"capInsets":[6,6,6,6]}],[1],0,[0],[2],[12]],[[{"name":"bg_ba41852b-ab41-4cfc-ad4b-27dd1e69efbe","rect":[0,0,64,65],"offset":[0,0],"originalSize":[64,65],"capInsets":[25,25,25,30]}],[1],0,[0],[2],[13]],[[{"name":"btn_lan","rect":[0,0,190,50],"offset":[0,0],"originalSize":[190,50],"capInsets":[50,0,50,0]}],[1],0,[0],[2],[14]],[[{"name":"user_agreement","rect":[0,0,81,22],"offset":[0,0],"originalSize":[81,22],"capInsets":[0,0,0,0]}],[1],0,[0],[2],[15]]]]